Documents/ПродажаВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ПродажаВалюты</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПродажаВалюты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    // Автоматизация заполнения полей по умолчанию
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Константы.ОсновнаяОрганизация.Получить();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ТабличнаяЧастьПолучитьКурсВалютыНаСервере(ТекВалюта, ТекДата)
	Если ТекВалюта = Справочники.Валюты.Рубль Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |   КурсыВалют.Период КАК Период,
        |   КурсыВалют.Валюта КАК Валюта,
        |   КурсыВалют.Курс КАК Курс,
        |   КурсыВалют.Кратность КАК Кратность
        |ИЗ
        |   РегистрСведений.КурсыВалют.СрезПоследних(&ПарПериод, Валюта = &ПарВалюта) КАК КурсыВалют";
	
    Запрос.УстановитьПараметр("ПарВалюта", ТекВалюта);
	Запрос.УстановитьПараметр("ПарПериод", ТекДата);

    Выборка = Запрос.Выполнить().Выбрать();

    Результат = Новый Структура("Курс, Кратность", 0, 1);

    Если Выборка.Следующий() Тогда
        Результат.Курс = Выборка.Курс;
        Результат.Кратность = Выборка.Кратность;
    КонецЕсли;

    Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ТабличнаяЧастьВалютаПриИзменении(Элемент)
    ТекДанные = Элементы.ТабличнаяЧасть.ТекущиеДанные;
    Если ТекДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
	
	
    Результат = ТабличнаяЧастьПолучитьКурсВалютыНаСервере(ТекДанные.Валюта, Объект.Дата); 
	
	Если Результат <> ЛОЖЬ Тогда
	    ТекДанные.Курс = Результат.Курс;
	    ТекДанные.Кратность = Результат.Кратность;
		ТабличнаяЧастьПосчитатьСумму(Элемент);
	Иначе
        ПоказатьПредупреждение(, "Нельзя выбирать предопределённые валюты (рубль).");
        ТекДанные.Валюта = Неопределено;
        ТекДанные.Курс = Неопределено;
        ТекДанные.Кратность = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьПосчитатьСумму(Элемент)
    ТекДанные = Элементы.ТабличнаяЧасть.ТекущиеДанные;
    Если ТекДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
	
	ТекДанные.Сумма = Окр(ТекДанные.Курс * ТекДанные.Количество,2,РежимОкругления.Окр15как10);
    ТабличнаяЧастьПриИзменении(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧастьПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.ТабличнаяЧасть.Итог("Сумма");
	СуммаДокументаПрописью = РаботаСДокументамиКлиент.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СуммаДокументаПрописью = РаботаСДокументамиКлиент.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
КонецПроцедуры
